#include <iostream>
#include <cmath>

using namespace std;

//Благ број е број што е составен само од парни цифри (0, 2, 4, 6, 8).
//Во зададен опсег (почетокот m и крајот на опегот n се цели броеви чија вредност се внесува од тастатура),
//да се најде и испечати најмалиот „благ број“. Ако не постои таков број, да се испечати NE.
//For example: Input --> 99, 500; Output: 200
int main()
{
    // Почеток и крај на опсег
    int m, n;
    cin>>m>>n;

    //Број кој што не е благ број е 1, па затоа претпоставуваме дека резултатот не ни е благ број
    int result=1;

    for(int i=m; i<=n; i++)
    {
        // Ги наоѓаме цифрите од кои е составен бројот
        int onesDigit = i % 10;
        int tensDigit = (i%100)/10;
        int hundreadsDigit = (i%1000)/100;
        int thousandsDigit = i/1000;

        // Проверуваме дали секоја од цифрите е парен број
        if(onesDigit%2 ==0 && tensDigit%2==0 && hundreadsDigit%2==0 && thousandsDigit%2==0)
        {
            // Најден е најмалиот благ број кој ќе го сместиме во променливата result
            // со зборчето break му кажуваме на програмата да прекини извршувањето на циклусот
            result = i;
            break;
        }
    }

    if(result != 1)
    {
        cout<<result<<endl;
    }
    else
    {
        cout<<"NЕ"<<endl;
    }

    return 0;
}
