#include <iostream>

using namespace std;

//Задача 1
//Напиши програма каде ќе се пресмета сума од сите вредности помеѓу 1-30 кои се
//деливи со 10 и производ од сите останати вредности. Резултатот да се отпечати.
int main()
{
    int sum=0;

    for(int i=0; i<30; i++)
    {

        if((i+1)%10==0)
        {
            sum+=i+1;
        }
    }

    cout<<"Result:"<<sum<<endl;

    return 0;
}

