#include<iostream>

using namespace std;

//Задача 15
//За еден природен број а велиме дека е порамнување на друг природен број b
//ако и само ако цифрите еднакви на 9 во бројот b се заменети со цифрата 7 во бројот а.
//
//Пример. Бројот 734775 е порамнување на бројот 934795.
//
//Од стандарден влез се внесуваат непознат број на цели броеви (не повеќе од 100),
//се додека не се внесе нешто што не може да се интерпретира како цел број.
//
//Ваша задача е да ги отпечатите најмалите 5 од порамнувањата на сите внесени броеви, по редослед од најмалиот кон најголемиот.
//
//Забелешка: Доколку се внесат помалку од 5 броеви, тогаш печатите толку броеви колку што се соодветно внесени.
//
//Наоѓањето на порамнувањето на даден број треба да се реализира во посебна рекурзивна функција poramnet(int a).
//
//Пример.
//
//За броевите: 9592, 69403, 100007, 6, 987, 6977, 33439,
//
//треба да се најдат нивните порамнувања ( тоа се: 7572, 67403, 100007, 6, 787, 6777 и 33437, соодветно),
//
//и да се отпечатат најмалите 5 од нив по овој редослед: 6 787 6777 7572 33437.
//
//ЗАБРАНЕТО е користење на глобални променливи.

// A function to implement bubble sort
void bubbleSort(int arr[], int n)
{
    int i, j;
    for (i = 0; i < n - 1; i++)

        // Last i elements are already
        // in place
        for (j = 0; j < n - i - 1; j++)
            if (arr[j] > arr[j + 1])
                swap(arr[j], arr[j + 1]);
}

int poramnet(int a){

    int digit = a%10;

    if(digit==9){
        digit=7;
    }

    if(a<10){
        return digit;
    }

    return 10*poramnet(a/10)+digit;
}

int main()
{
    int numbers[100];

    int number;
    cin>>number;

    int n=0;

    while(number!=0){

        int transformedNumber=poramnet(number);

        numbers[n]=transformedNumber;

        n++;

        cin>>number;
    }

    bubbleSort(numbers, n);

    int limit = n <= 5? n: 5;

    for(int i=0;i<limit;i++){
        cout<<numbers[i]<<" ";
    }

    cout<<endl;

    return 0;
}
